Repository: IbrohimjonSodikov/uzbeautyshop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Phone number
uz: Telefon raqamingiz

source: Thank you for your message! We'll get back to you shortly.
uz: Xabaringiz uchun rahmat! Tez orada sizga xabar beramiz.

source: Product added to your cart! Go to your cart to order
uz: Mahsulot savatingizga qo'shildi! Buyurtma berish uchun savatga boring

source: Product added to your favorites!
uz: Mahsulot sevimlilarga qo'shildi!

source: Your cart is empty. Please add something first!
uz: Sizning savatingiz bo'sh. Iltimos, avval nimadir qo'shing!

source: Your order has been successfully placed!
uz: Buyurtmangiz muvaffaqiyatli yuborildi!

source: About Us
uz: Biz haqimizda

source: Discover our story, mission, and vision as we strive to inspire beauty and confidence around the world.
uz: Butun dunyo bo'ylab go'zallik va ishonchni ilhomlantirishga intilar ekanmiz, bizning hikoyamiz, vazifamiz va qarashlarimizni kashf eting.

source: Our Mission
uz: Bizning vazifamiz

source: We aim to empower every individual by providing them with exceptional beauty products that not only enhance their appearance but also boost their confidence. Our commitment is to deliver quality with integrity and passion.
uz: Biz har bir insonga nafaqat tashqi ko'rinishini yaxshilaydigan, balki o'ziga bo'lgan ishonchni ham oshiradigan ajoyib go'zallik mahsulotlarini taqdim etish orqali ularni kuchaytirishni maqsad qilganmiz. Bizning majburiyatimiz sifatni yaxlitlik va ishtiyoq bilan yetkazib berishdir.

source: Our Vision
uz: Bizning qarashimiz

source: To lead the beauty industry by creating a lasting impact on the lives of millions, making beauty accessible to all while prioritizing sustainability, inclusivity, and innovation.
uz: Barqarorlik, inklyuzivlik va innovatsiyalarni birinchi oʻringa qoʻyib, goʻzallikni barcha uchun ochiq qilib, millionlab insonlar hayotiga doimiy taʼsir koʻrsatish orqali goʻzallik sanoatini boshqarish.

source: Our Core Values
uz: Bizning asosiy maqsadlarimiz

source: The principles that guide us and keep us grounded in everything we do.
uz: Bizni boshqaradigan va biz qilayotgan har bir ishda asoslanib turadigan tamoyillar.

source: Passion
uz: Qiziqish

source: Driven by passion, we create beauty with heart, focusing on quality and detail in everything we do.
uz: Qiziqishga tayanib, biz har bir ishda sifat va tafsilotlarga e'tibor qaratib, yurak bilan go'zallikni yaratamiz.

source: Sustainability
uz: Barqarorlik

source: We prioritize the planet by embracing sustainable practices in our products and operations.
uz: Biz o'z mahsulotlarimiz va operatsiyalarimizda barqaror amaliyotlarni qo'llash orqali sayyoramizga ustuvor ahamiyat beramiz.

source: Inclusivity
uz: Inklyuzivlik

source: We believe in inclusivity, offering beauty solutions for all, regardless of background or identity.
uz: Biz inklyuzivlikka ishonamiz, kelib chiqishi yoki kimligidan qat'i nazar, barcha uchun go'zallik echimlarini taklif qilamiz.

source: Innovation
uz: Innovatsiya

source: Constantly evolving, we push the boundaries of beauty with innovative products and technologies.
uz: Doimiy ravishda rivojlanib, biz innovatsion mahsulotlar va texnologiyalar bilan go'zallik chegaralarini kengaytiramiz.

source: Join Us in Our Mission
uz: Missiyamizga qo'shiling

source: Be a part of our journey as we continue to make a difference in the beauty world. We welcome you to stay connected with us and be part of the change!
uz: Go'zallik olamida o'zgarishlar qilishda davom etayotganimiz uchun sayohatimizning bir qismi bo'ling. Biz bilan aloqada bo'lishingiz va o'zgarishlarning bir qismi bo'lishingiz uchun sizni tabriklaymiz!

source: Get in Touch
uz: Biz bilan aloqaga chiqing

source: Categories
uz: Kategoriyalar

source: Tap here to explore categories and choose your perfect match from our luxurious collection.
uz: Kategoriyalarni tanlash uchun bu yerga bosin va bizning kolleksiyamizdan o'zingizga yoqqanini tanlang

source: Buy Now
uz: Sotib olish

source: All Blogs
uz: Barcha Yangiliklar

source: Comments
uz: Izohlar

source: No comments yet. Be the first to comment!
uz: Hozircha izohlar yo‘q. Birinchi bo'lib fikr bildiring!

source: Leave a Comment
uz: Izoh qoldiring

source: Write your comment here...
uz: Izogingizni shu yerga yozing...

source: Submit
uz: Yuborish

source: Login
uz: Kirish

source: to leave a comment
uz: izoh qoldirish uchun tizimga kiring

source: Our Blog
uz: Yangiliklar

source: Read more
uz: Ko'proq o'qish

source: Home
uz: Asosiy

source: Brands
uz: Brendlar

source: Germany
uz: Germaniya

source: France
uz: Fransiya

source: Italy
uz: Italiya

source: Blog
uz: Yangiliklar

source: Contact Us
uz: Biz bilan aloqa

source: Your profile
uz: Sizning profilingiz

source: Welcome:
uz: Xush kelibsiz

source: Order history
uz: Buyurtmalar tarixi

source: Change password
uz: Parolni o'zgartirish

source: Logout
uz: Chiqish

source: Join us
uz: Bizga qo'shiling

source: Sign up
uz: Ro'yxattan o'tish

source: Orders
uz: Buyurtmalar

source: Messages
uz: Xabarlar

source: Change Password
uz: Parolni o'zgartirish

source: Get all types of cosmetics from us within 14 day delivery. We can even order the cosmetics which are not in our database. To do that kindly send a E-mail to the company's mail id.
uz: Barcha turdagi istalgan kosmetika maxsulotlarini 14 kun ichida qabul qiling. Undan tashqari, bizda yo'q maxsulotlarni buyurtma qilishni xoxlasangiz, iltimos bizga murojaat qiling:

source: Information
uz: Ma'lumotlar

source: Prices
uz: Narxlar

source: Terms & Conditions
uz: Foydalanish shartlari

source: Order History
uz: Buyurtmalar tarixi

source: Wish List
uz: Istaklar roʻyxati

source: Specials
uz: Siz uchun maxsus

source: Newsletter
uz: Gazeta

source: Price
uz: Narxi

source: View Details
uz: Batafsil

source: No products available from this brand.
uz: Bu brending hech qanday maxsulorlari topilmadi.

source: All products
uz: Barcha maxsulotlar

source: Your Cart
uz: Savat

source: Quantity:
uz: Soni:

source: Price:
uz: Narx:

source: Total:
uz: Jami:

source: Remove
uz: O'chirish

source: Total Price:
uz: Umumiy Narx:

source: Proceed to Checkout
uz: Sotib olish

source: Oops! Your cart is currently empty.
uz: Voy! Savatingiz hozir boʻsh.

source: It looks like you haven’t added any products yet. Don’t worry, it’s just a few clicks away!
uz: Siz hali hech qanday mahsulot qo'shmaganga o'xshaysiz. Avval maxsulotlarni ko'rib chiqing!

source: Browse Products
uz: Mahsulotlarni ko'rib chiqish

source: Start shopping now and fill your cart with amazing items!
uz: Hozir xarid qilishni boshlang va savatingizni ajoyib narsalar bilan to'ldiring!

source: Fill checkout information
uz: To'lov ma'lumotlarini to'ldiring

source: Billing Address
uz: Malumotlar

source: Full Name
uz: To'liq ism

source: Enter your full name
uz: To'liq ismingizni kiriting

source: Enter your email
uz: Elektron pochta

source: Address
uz: Manzil

source: Your full address for delivery
uz: Sizning to'liq manzilingiz (yetkazib berish uchun)

source: Your phone number
uz: Telefon raqamingiz

source: Product Specifications (Optional)
uz: Mahsulot xususiyatlari (ixtiyoriy)

source: For example: I need lipstick's pink color
uz: Misol uchun: Menga lab bo'yog'ini pushti rangi kerak

source: Payment
uz: To'lov

source: Please select payment type
uz: Iltimos, to'lov turini tanlang

source: By Cash
uz: Naqd

source: By Card (Coming Soon)
uz: Karta orqali (Tez orada)

source: Once you place your order, it cannot be undone. We can not take it back. Please be sure before proceeding.
uz: Zakas berganingizdan so'ng, uni bekor qilib bo'lmaydi. Biz qaytarib olmaymiz. Iltimos buyurtma berishdan avval buyurtmangizni qayta ko'rib chiqing.

source: Also, note that our website is working on a test mode, it means you can receive your order 3 to 30 working days. Sorry for the inconvinience.
uz: Shuni ham yodda tutingki, bizning veb-saytimiz test rejimida ishlamoqda, bu sizning buyurtmangizni 3 dan 30 ish kunigacha olishingiz mumkinligini anglatadi. Noqulayliklar uchun uzr so'raymiz.

source: You will pay the amount only when you get the product (by cash or card if you want).
uz: Siz summani faqat mahsulotni olganingizda to'laysiz (xohlasangiz naqd pul yoki karta orqali)

source: I agree to the terms and conditions
uz: Men ushbu shart va qoidalarga roziman

source: Proceed
uz: Buyurtma berish

source: You must agree to the terms and conditions before proceeding.
uz: Siz buyurtma berishdan avval qoida va shartlarga rozi bo'lishingiz shart.

source: Please select a payment method.
uz: Iltimos to'lov turini tanlang.

source: We’d Love to Hear From You
uz: Biz sizdan eshitishni istaymiz

source: Feel free to reach out with any questions or feedback. We are here to help!
uz: Har qanday savol yoki fikr-mulohazalar bilan bog'lanishingiz mumkin. Biz yordam berish uchun shu yerdamiz!

source: 24/7 Support
uz: 24/7 Qo'llab quvvatlash

source: Our team is always available to help you with any inquiries. We're just a message away!
uz: Bizning jamoamiz har qanday savollar bo'yicha sizga yordam berishga tayyor. Bizga xabar bering!

source: Fast Responses
uz: Tezkor javoblar

source: We value your time and aim to respond within hours, ensuring a smooth experience.
uz: “Biz sizning vaqtingizni qadrlaymiz va bir necha soat ichida javob berishni maqsad qilib qo‘yamiz, bu esa muammosiz tajribani ta’minlaydi.

source: Exclusive Updates
uz: Eksklyuziv yangilanishlar

source: Stay ahead of the curve with our exclusive offers and news, directly from our team.
uz: “Bizning eksklyuziv takliflarimiz va yangiliklarimiz bilan to‘g‘ridan-to‘g‘ri jamoamizdan oldinda bo‘ling.

source: Thank you!
uz: Raxmat!

source: Your Name
uz: Sizning ismingiz

source: Your Email
uz: Elektron pochta

source: Your Phone Number
uz: Telefon raqamingiz

source: Enter your phone number
uz: Telefon raqamingizni kiriting

source: Your Message
uz: Sizning habaringiz

source: Write your message here
uz: Xabaringizni yozing

source: Send Message
uz: Yuborish

source: Connect With Us
uz: Biz bilan bog'laning

source: Follow us on social media to stay updated on the latest news, promotions, and product launches
uz: So'nggi yangiliklar, reklama aktsiyalari va mahsulot taqdimotlaridan xabardor bo'lish uchun bizni ijtimoiy tarmoqlarda kuzatib boring

source: Visit Us
uz: Bizga tashrif buyuring

source: Feel free to stop by at our office anytime. We would love to meet you in person!
uz: Istalgan vaqtda bizning ofisimizga tashrif buyuring. Biz siz bilan shaxsan uchrashishdan xursandmiz!

source: Back
uz: Orqaga

source: Products of
uz: Maxsulotlar:

source: No products found in this category.
uz: Bu kategoriyaga doir hech qanday maxsulot topilmadi.

source: Your Favorites
uz: Sevimlilaringiz

source: Description:
uz: Batafsil:

source: Oops! Your favorites list is currently empty.
uz: Voy! Sizda sevimlilar roʻyxati hozircha boʻsh.

source: You haven’t added any products yet. But don’t worry, you can start exploring now!
uz: Siz hali hech qanday mahsulot qo'shmaganga o'xshaysiz. Avval maxsulotlarni ko'rib chiqing!

source: Find something you love and add it to your favorites!
uz: O'zingiz yoqtirgan narsani toping va uni sevimlilaringizga qo'shing!

source: Best collection
uz: Yevropa kosmetikalarning

source: of cosmetics
uz: Eng zo'r toplami

source: Order the best cosmetics from Europe from the place you want
uz: Yevropaning eng zo'r kosmetikalarini biz bilan buyurtma bering

source: Shop Now
uz: Xaridni boshlash

source: New Products
uz: Yangi maxsulotlar

source: Please slide for more
uz: Iltimos, ko'prog'ini ko'rish uchun chapga suring

source: Hot Deals
uz: Issiq takliflar

source: Best Sellers
uz: Eng yaxshi sotuvchilar

source: Sale up to
uz: Skidkalar

source: On Sale
uz: Sotuvda:

source: Add to cart
uz: Savatga qo'shish

source: Order Status
uz: Buyurtma xolati

source: Your Order History
uz: Buyurtmalar tarixi

source: Order ID
uz: Buyurtma raqami

source: Products
uz: Maxsulotlar

source: Total Price
uz: Umumiy narx

source: Order Date
uz: Buyurtmala vaqti

source: Status
uz: Holati

source: You have no orders yet.
uz: Siz hali zakas qilmadingiz.

source: Please, note that if the order status is Pending, it means we received your order but its not delivered to Uzbekistan yet. If the order status is Shipped, it means it has delivered to Uzbekistan. If the status is Delivered, it means you received the product(s). If there is an issue, please don't hesitate to send us a message by clicking Send a message button
uz: E'tibor bering, agar buyurtma holati 'Pending' bo'lsa, biz sizning buyurtmangizni oldik, lekin u hali O'zbekistonga yetkazilmaganligini anglatadi. Buyurtma holati 'Shipped' bo'lsa, bu O'zbekistonga yetkazib berilganligini bildiradi. Agar holat 'Delivered' bo'lsa, bu siz mahsulotni(lar)ni olganingizni bildiradi. Agar muammo yuzaga kelsa, iltimos, 'Xabar yuborish' tugmasini bosish orqali bizga xabar yuborishdan tortinmang

source: Send a message
uz: Xabar yuborish

source: Add to favorites
uz: Sevimlilarga qo'shish

source: Success!
uz: Muvaffaqiyatli

source: Customer Reviews
uz: Mijozlardan izohlar

source: Average Rating
uz: O'rtacha reyting

source: Posted on
uz: Izoh qoldirilgan sana

source: No reviews yet. Be the first to leave one!
uz: Hozircha izohlar yo‘q. Birinchi bo'lib fikr bildiring!

source: Leave a Review
uz: Izoh qoldiring

source: Your Rating
uz: Sizning balingiz

source: Your Review
uz: Sizning izohingiz

source: Write your review here...
uz: Xabaringizni yozing...

source: Submit Review
uz: Izoh qoldirish

source: You may also like
uz: Sizga yoqishi mumkin

source: Details
uz: Ma'lumotlar

source: Welcome Back!
uz: Xush kelibsiz

source: Please login to your account to continue.
uz: Iltimos davom etish uchun akkountingizga kiring

source: Forgot Password?
uz: Parolni esdan chiqdimi?

source: Password Successfully Changed
uz: Parol Muvaffaqiyatli o'zgartirildi

source: You can now log in using your new password.
uz: Siz endi yangi parol bilan kirishingiz mumkin

source: Go to Login Page
uz: Akkountga kirish

source: Change Your Password
uz: Parolni o'zgartirish

source: Please enter your old password and your new password twice to confirm.
uz: Iltimos, avval eski parolni kiriting va keyin, yangi parolni 2 marta kiriting

source: Password Changed
uz: Parol o'zgartirildi

source: Your password has been successfully updated. You can now log in using your new password.
uz: Parol o'zgartirildi. Siz endi yangi parol bilan kirishingiz mumkin

source: Go to Log In Page
uz: Akkountga kirish

source: Enter New Password
uz: Yangi parolingizni kiriting

source: Please enter your new password below to update your credentials.
uz: Iltmos yangi parolingizni kiriting

source: Please Check Your Email
uz: Iltimos Email ni tekshiring

source: Information about your password change has been sent to your email!
uz: Parol o'zgartirish haqidagi malumotlar sizga email orqali yuborildi

source: Make sure to check your inbox (and spam folder if needed).
uz: Iltimos email ni tekshiring

source: Forgot Your Password?
uz: Parolni unuttingizmi?

source: Enter your email below to reset your password. We’ll send you a link to create a new one.
uz: Parolni tiklash uchun pochtangizni kiriting

source: Create an Account
uz: Ro'yxattan o'tish

source: Fill in the details below to sign up and get started.
uz: Iltimos, ro'yxattan o'tish uchun quyidagi ma'lumotlarni to'ldiring

source: Sign Up
uz: Ro'yxattan o'tish

source: Already have an account?
uz: Akkountingiz bormi?

source: Search Results for
uz: Qidiruv natijalari:

source: Add to Cart
uz: Savatga qo'shish

source: No products found. Try searching for something else.
uz: Bunday maxsulot topilmadi. Iltimos boshqa narsani qidirib ko'ring
